In [66]:
from statistics import correlation

import numpy as np
import pandas as pd

# Task 0
Read the dataset from csv file & perform data cleaning - remove all rows, which contains `?` in some columns.
Also check for data correctness (salary & salary $K).

In [103]:
# write your code for task 0 here
salary_df = pd.read_csv("../data/adult.csv")
salary_df.value_counts()

Unnamed: 0  age  workclass         education   marital-status      occupation         relationship   race   sex     hours-per-week  native-country  salary  salary K$
32560       52   Self-emp-inc      HS-grad     Married-civ-spouse  Exec-managerial    Wife           White  Female  40              United-States   >50K    243          1
32544       31   Private           Masters     Divorced            Other-service      Not-in-family  Other  Female  30              United-States   <=50K   33           1
32543       45   Local-gov         Assoc-acdm  Divorced            Prof-specialty     Unmarried      White  Female  48              United-States   <=50K   19           1
32542       72   ?                 HS-grad     Married-civ-spouse  ?                  Husband        White  Male    25              United-States   <=50K   16           1
32541       41   ?                 HS-grad     Separated           ?                  Not-in-family  Black  Female  32              United-States   <=50K   34           1
                                                                                                                                                                        ..
5           37   Private           Masters     Married-civ-spouse  Exec-managerial    Wife           White  Female  40              United-States   <=50K   44           1
4           28   Private           Bachelors   Married-civ-spouse  Prof-specialty     Wife           Black  Female  40              Cuba            <=50K   25           1
3           53   Private           11th        Married-civ-spouse  Handlers-cleaners  Husband        Black  Male    40              United-States   <=50K   43           1
2           38   Private           HS-grad     Divorced            Handlers-cleaners  Not-in-family  White  Male    40              United-States   <=50K   27           1
1           50   Self-emp-not-inc  Bachelors   Married-civ-spouse  Exec-managerial    Husband        White  Male    13              United-States   <=50K   35           1
Name: count, Length: 32561, dtype: int64

In [68]:
# Checks for data correctness in "salary" & "salary K$"

missing_salary = salary_df["salary"].isnull().sum()
missing_salary_k = salary_df["salary K$"].isnull().sum()

invalid_salary = (salary_df["salary"] == "?").sum()
invalid_salary_k = (salary_df["salary K$"] == "?").sum()

print(f"Missing values in 'salary': {missing_salary}")
print(f"Missing values in 'salary K$': {missing_salary_k}")
print(f"Invalid values ('?') in 'salary': {invalid_salary}")
print(f"Invalid values ('?') in 'salary K$': {invalid_salary_k}")

Missing values in 'salary': 0
Missing values in 'salary K$': 0
Invalid values ('?') in 'salary': 0
Invalid values ('?') in 'salary K$': 0

In [101]:
# removing rows which contains ?
salary_df_cleaned = salary_df[~salary_df.isin(["?"]).any(axis=1)]
salary_df_cleaned.head()

,Unnamed: 0,age,workclass,education,marital-status,occupation,relationship,race,sex,hours-per-week,native-country,salary,salary K$
0,0,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K,39
1,1,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K,35
2,2,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K,27
3,3,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K,43
4,4,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K,25

# Task 1
Print the count of men and women in the dataset.

In [70]:
# write your code for task 1 here
male_count = (salary_df_cleaned["sex"] == "Male").sum()
female_count = (salary_df_cleaned["sex"] == "Female").sum()
print(f"Male: {male_count}, Female: {female_count}")

Male: 20380, Female: 9782

# Task 2
Find the average age of men in dataset

In [82]:
# write your code for task 2 here
men_mean_age = salary_df_cleaned.loc[salary_df_cleaned["sex"] == "Male", "age"].mean().round(2)
men_mean_age

np.float64(39.18)

# Task 3
Get the percentage of people from Poland (native-country)

In [94]:
# write your code for task 3 here
people_all = len(salary_df_cleaned)
people_from_poland = (salary_df_cleaned["native-country"] == "Poland").sum()
percentage = people_from_poland / people_all * 100
print(f"Percentage of people from Poland: {percentage:.2f}%")

Percentage of people from Poland: 0.19%

# Task 4
Get the mean and standard deviation of the age for people who earn > 50K per year. After this, get it for those who earn <= 50K.

In [99]:
# write your code for task 4 here
age_std_dev_more50 = salary_df_cleaned[salary_df_cleaned["salary"] == ">50K"]["age"].std()
age_mean_more50 = salary_df_cleaned[salary_df_cleaned["salary"] == ">50K"]["age"].mean()
print(f"standard deviation of age for people whe earn <=50K: {age_std_dev_more50:.2f}")
print(f"mean age for people whe earn <=50K: {age_mean_more50:.2f}")

age_std_dev_less50 = salary_df_cleaned[salary_df_cleaned["salary"] == "<=50K"]["age"].std()
age_mean_less50 = salary_df_cleaned[salary_df_cleaned["salary"] == "<=50K"]["age"].mean()
print(f"standard deviation of age for people whe earn <=50K: {age_std_dev_less50:.2f}")
print(f"mean age for people whe earn <=50K: {age_mean_less50:.2f}")

standard deviation of age for people whe earn <=50K: 10.27
mean age for people whe earn <=50K: 43.96
standard deviation of age for people whe earn <=50K: 13.46
mean age for people whe earn <=50K: 36.61

# Task 5
Check, if there are some people without higher education (education: Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters, Doctorate), but with > 50K salary

In [111]:
# write your code for task 5 here
higher_education = ["Bachelors", "Prof-school", "Assoc-acdm", "Assoc-voc", "Masters", "Doctorate"]

high_education_high_salary_df = salary_df_cleaned[
    (salary_df_cleaned["education"].isin(higher_education)) &
    (salary_df_cleaned["salary"] == ">50K")
]
high_education_high_salary_df

,Unnamed: 0,age,workclass,education,marital-status,occupation,relationship,race,sex,hours-per-week,native-country,salary,salary K$
8,8,31,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,50,United-States,>50K,330
9,9,42,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,40,United-States,>50K,303
11,11,30,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,40,India,>50K,279
19,19,43,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,45,United-States,>50K,151
20,20,40,Private,Doctorate,Married-civ-spouse,Prof-specialty,Husband,White,Male,60,United-States,>50K,265
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32533,32533,54,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,Asian-Pac-Islander,Male,50,Japan,>50K,347
32536,32536,34,Private,Bachelors,Never-married,Exec-managerial,Not-in-family,White,Female,55,United-States,>50K,260
32538,32538,38,Private,Bachelors,Divorced,Prof-specialty,Unmarried,Black,Female,45,United-States,>50K,248
32545,32545,39,Local-gov,Assoc-acdm,Married-civ-spouse,Adm-clerical,Wife,White,Female,20,United-States,>50K,122
32554,32554,53,Private,Masters,Married-civ-spouse,Exec-managerial,Husband,White,Male,40,United-States,>50K,103

# Task 6
Get the statistics of age for each type of education. Use `groupby` and `describe` for this.

In [114]:
# write your code for task 6 here
age_stats_by_education = salary_df_cleaned.groupby("education")["age"].describe()
age_stats_by_education

               count       mean        std   min   25%   50%   75%   max
education
10th           820.0  37.897561  16.225795  17.0  23.0  36.0  52.0  90.0
11th          1048.0  32.363550  15.089307  17.0  18.0  28.5  43.0  90.0
12th           377.0  32.013263  14.373710  17.0  19.0  28.0  41.0  79.0
1st-4th        151.0  44.622517  14.929051  19.0  33.0  44.0  56.0  81.0
5th-6th        288.0  41.649306  14.754622  17.0  28.0  41.0  53.0  82.0
7th-8th        557.0  47.631957  15.737479  17.0  34.0  49.0  60.0  90.0
9th            455.0  40.303297  15.335754  17.0  28.0  38.0  53.0  90.0
Assoc-acdm    1008.0  37.286706  10.509755  19.0  29.0  36.0  44.0  90.0
Assoc-voc     1307.0  38.246366  11.181253  19.0  30.0  37.0  45.0  84.0
Bachelors     5044.0  38.641554  11.577566  19.0  29.0  37.0  46.0  90.0
Doctorate      375.0  47.130667  11.471727  24.0  39.0  47.0  54.0  80.0
HS-grad       9840.0  38.640955  13.067730  17.0  28.0  37.0  48.0  90.0
Masters       1627.0  43.740012  10.735356  18.0  36.0  43.0  50.0  90.0
Preschool       45.0  41.288889  15.175672  19.0  30.0  40.0  53.0  75.0
Prof-school    542.0  44.249077  11.428098  25.0  36.0  43.0  50.0  90.0
Some-college  6678.0  36.135370  13.073528  17.0  25.0  35.0  45.0  90.0

# Task 7
Compare the married and non-married men salaries. Who earns more? (>50K or <=50K)
Married men are those, whom `marital-status` starts with "Married". Others are not.

In [120]:
# write your code for task 7 here
married_men = salary_df_cleaned[
    (salary_df_cleaned["sex"] == "Male") &
    (salary_df_cleaned["marital-status"] == "Married-civ-spouse")]

not_married_men = salary_df_cleaned[
    (salary_df_cleaned["sex"] == "Male") &
    (salary_df_cleaned["marital-status"] != "Married-civ-spouse")]

married_men_salary_counts = married_men["salary"].value_counts()
not_married_men_salary_counts = not_married_men["salary"].value_counts()

print("Married Men Salary Counts:")
print(married_men_salary_counts)

print("\nNon-Married Men Salary Counts:")
print(not_married_men_salary_counts)

Married Men Salary Counts:
salary
<=50K    6886
>50K     5699
Name: count, dtype: int64

Non-Married Men Salary Counts:
salary
<=50K    7098
>50K      697
Name: count, dtype: int64

# Task 8
Get the max hours per week some person works. How many people works the same amount of hours per week?

In [128]:
# write your code for task 8 here
max_hours_working = salary_df_cleaned["hours-per-week"].max()
count_max_hours_workers = (salary_df_cleaned["hours-per-week"] == max_hours_working).sum()
count_max_hours_workers

np.int64(78)

# Task 9
Analyze the correlation between data in dataset. Understand connected fields in it and print highlight thier connection.

In [131]:
# write your code for task 9 here
numeric_salary_df = salary_df_cleaned.select_dtypes(include=["number"])
correlation_matrix = numeric_salary_df.corr()
correlation_matrix

                Unnamed: 0       age  hours-per-week  salary K$
Unnamed: 0        1.000000 -0.001126       -0.001890   0.000129
age              -0.001126  1.000000        0.101599   0.208203
hours-per-week   -0.001890  0.101599        1.000000   0.196378
salary K$         0.000129  0.208203        0.196378   1.000000